app/views/profiles/show.html.erb

      	<% end %>
		<h3><%= @profile.user.first_name %> <%= @profile.user.last_name %></h3>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]