app/views/interests/myinterests.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
					<h3><%= interest.post.category %></h3>
					<h3>By <%= interest.post.user.first_name %> <%= interest.post.user.last_name %></h3>