app/views/posts/myposts.html.erb

					<h4><%= post.category %></h4>
					<h4>By <%= post.user.first_name %> <%= post.user.last_name %></h4>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]