app/views/posts/sharedwithme.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      		<% end %>
			<h3><%= interest.user.first_name %> <%= interest.user.last_name %></h3>