app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
	<h3><%= @post.category %></h3>
	<h3>By <%= @post.user.first_name %> <%= @post.user.last_name %></h3>