app/controllers/interests_controller.rb

  def create
  	if current_user.profile.present?
	  	@user = current_user
	  	@post = Post.find(params[:id])
	  	@interest = Interest.new
	  	@interest.user_id = @user.id
	  	@interest.post_id = @post.id
	  	@interest.save!
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "interests" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 1], ["user_id", 2], ["created_at", "2017-09-13 00:26:22.023734"], ["updated_at", "2017-09-13 00:26:22.023734"]]

  def myinterests
  	@interests = current_user.interests.all
---
SELECT "interests".* FROM "interests" WHERE "interests"."user_id" = ?  [["user_id", 1]]

  def destroy
    @interest = Interest.find(params[:id])
    @interest.destroy
---
SELECT  "interests".* FROM "interests" WHERE "interests"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "interests" WHERE "interests"."id" = ?  [["id", 1]]