app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def home
    @posts = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "interests".* FROM "interests" WHERE "interests"."post_id" = ? LIMIT ?  [["post_id", 3], ["LIMIT", 1]]
DELETE FROM "interests" WHERE "interests"."id" = ?  [["id", 2]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    if Interest.find_by(post_id: @post.id).present?
      Interest.find_by(post_id: @post.id).destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "requirements" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Test"], ["requirements", "Test"], ["updated_at", "2017-09-13 22:51:38.184459"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)

INSERT INTO "posts" ("title", "description", "requirements", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "hello"], ["description", "asdhkasd"], ["requirements", "sahdasldas"], ["location", "cats"], ["created_at", "2017-09-08 00:38:19.200320"], ["updated_at", "2017-09-08 00:38:19.200320"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
---
  def myposts
    @posts = current_user.posts.all

SELECT "posts"."id" FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT "interests".* FROM "interests" WHERE "interests"."post_id" IN (1, 2)
---
  def sharedwithme
    @posts = current_user.posts.all
    @interests = Interest.where(post_id: @posts.ids)