app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
  def show
    @city = request.location.city
    if Profile.where(:user_id => current_user.id).present?

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
UPDATE "profiles" SET "skills" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["skills", "me"], ["updated_at", "2017-09-08 21:38:18.357739"], ["id", 2]]
---
  def update
    @profile = Profile.find_by(user_id: current_user.id)
    if @profile.update(profile_params)

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
---
  def edit
    @profile = Profile.find_by(user_id: current_user.id)

INSERT INTO "profiles" ("user_id", "location", "skills", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["location", "asdasdsa"], ["skills", "asdasdsa"], ["bio", "asdasdasd"], ["created_at", "2017-09-08 19:13:20.308572"], ["updated_at", "2017-09-08 19:13:20.308572"]]
---
  def create
    @profile = Profile.new(profile_params)
    @profile.user_id = current_user.id
    if @profile.save