app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "meganweijiang@yahoo.com"], ["LIMIT", 1]]
---
  def create
    puts params[:email]
    user = User.find_by_email(params[:session][:email])