app/controllers/users_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "asdasda@a.com"], ["created_at", "2017-09-07 22:26:14.542187"], ["updated_at", "2017-09-07 22:26:14.542187"]]
---
  def create
    @user = User.new(user_params)
      if @user.save